tutorials/eulerVortex.ico.enforced/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
7606
(
3
3
3
3
3
3
3
3
...
)
;

boundaryField
{
    emptyPatches_empt
    {
        type            fixedValue;
        value           uniform 3;
    }
    top_cyc
    {
        type            fixedValue;
        value           uniform 3;
    }
    bottom_cyc
    {
        type            fixedValue;
        value           uniform 3;
    }
    inlet_cyc
    {
        type            fixedValue;
        value           uniform 3;
    }
    outlet_cyc
    {
        type            fixedValue;
        value           uniform 3;
    }
}


// ************************************************************************* //
